ErpTest/src/Documents/уатРазнарядка/уатРазнарядка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатРазнарядка</name>
  <comment>Разнарядка на выпуск ТС</comment>
  <registerRecords>InformationRegister.уатСостояниеТС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Колонна</name>
    <comment>Колонна</comment>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разнарядка</name>
    <comment>Разнарядка</comment>
    <attributes>
      <name>АдресПрибытия</name>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПрибытия2</name>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресУбытия1</name>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресУбытия2</name>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <comment>Водитель</comment>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель2</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПрибытия2</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяУбытия</name>
      <comment>Время убытия</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяУбытия2</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Груз1</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Груз2</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозвращения</name>
      <comment>Дата возвращения</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыезда</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Кондуктор</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Кондуктор2</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент2</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <comment>Подразделение</comment>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение2</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Прицеп1</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Прицеп2</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимРаботыТС</name>
      <comment>Режим работы ТС</comment>
      <type>
        <types>CatalogRef.уатРежимыРаботыТС</types>
      </type>
    </attributes>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут1</name>
      <type>
        <types>CatalogRef.уатМаршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут2</name>
      <type>
        <types>CatalogRef.уатМаршруты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/Documents/уатРазнарядка/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	тблДвижений = Новый ТаблицаЗначений;
	тблДвижений.Колонки.Добавить("Регистратор");
	тблДвижений.Колонки.Добавить("Период");
	тблДвижений.Колонки.Добавить("ДатаОкончания");
	тблДвижений.Колонки.Добавить("ТС");
	тблДвижений.Колонки.Добавить("Состояние");
	
	Для Каждого ТекСтрока Из ДокументСсылка.Разнарядка Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ТС) Тогда
			НоваяСтрока = тблДвижений.Добавить();
			НоваяСтрока.ТС = ТекСтрока.ТС;
			НоваяСтрока.Период = уатОбщегоНазначения.уатДатаБезСекунд(ТекСтрока.ДатаВыезда);
			НоваяСтрока.ДатаОкончания = ТекСтрока.ДатаВозвращения;
			НоваяСтрока.Состояние = Справочники.уатСостояниеТС.СформированаРазнарядка;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ДокументСсылка.Разнарядка Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Прицеп1) Тогда
			мсвСтрокПоиска = тблДвижений.НайтиСтроки(Новый Структура("ТС, Период", ТекСтрока.Прицеп1, уатОбщегоНазначения.уатДатаБезСекунд(ТекСтрока.ДатаВыезда)));
			Если мсвСтрокПоиска.Количество() = 0 Тогда
				НоваяСтрока = тблДвижений.Добавить();
				НоваяСтрока.ТС = ТекСтрока.Прицеп1;
				НоваяСтрока.Период = уатОбщегоНазначения.уатДатаБезСекунд(ТекСтрока.ДатаВыезда);
				НоваяСтрока.ДатаОкончания = ТекСтрока.ДатаВозвращения;
				НоваяСтрока.Состояние = Справочники.уатСостояниеТС.СформированаРазнарядка;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрока.Прицеп2) Тогда
			мсвСтрокПоиска = тблДвижений.НайтиСтроки(Новый Структура("ТС, Период", ТекСтрока.Прицеп2, уатОбщегоНазначения.уатДатаБезСекунд(ТекСтрока.ДатаВыезда)));
			Если мсвСтрокПоиска.Количество() = 0 Тогда
				НоваяСтрока = тблДвижений.Добавить();
				НоваяСтрока.ТС = ТекСтрока.Прицеп2;
				НоваяСтрока.Период = уатОбщегоНазначения.уатДатаБезСекунд(ТекСтрока.ДатаВыезда);
				НоваяСтрока.ДатаОкончания = ТекСтрока.ДатаВозвращения;
				НоваяСтрока.Состояние = Справочники.уатСостояниеТС.СформированаРазнарядка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянийТС", тблДвижений);
	
КонецПроцедуры

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Заглушка = Истина;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатРазнарядка";
	КомандаПечати.Идентификатор = "Разнарядка";
	КомандаПечати.Представление = НСтр("ru = 'Разнарядка'");
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Разнарядка") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Разнарядка",
			"Разнарядка", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Разнарядка";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ПервыйДокумент = Истина;
	
	ЛинияГраницы = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Разнарядка_Разнарядка";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатРазнарядка.ПФ_MXL_Разнарядка");
	
	ЗаголовокТС 			= Макет.ПолучитьОбласть("Заголовок|КолонкаТС" );
	ЗаголовокПрицепы 		= Макет.ПолучитьОбласть("Заголовок|КолонкаПрицепы" );
	ЗаголовокЗадание 		= Макет.ПолучитьОбласть("Заголовок|КолонкаЗадание" );
	ЗаголовокСопровождающие = Макет.ПолучитьОбласть("Заголовок|КолонкаСопровождающие" );
	
	ШапкаТС 				= Макет.ПолучитьОбласть("Шапка|КолонкаТС" );
	ШапкаПрицепы 			= Макет.ПолучитьОбласть("Шапка|КолонкаПрицепы" );
	ШапкаЗадание 			= Макет.ПолучитьОбласть("Шапка|КолонкаЗадание" );
	ШапкаСопровождающие 	= Макет.ПолучитьОбласть("Шапка|КолонкаСопровождающие" );
	
	СтрокаТС 				= Макет.ПолучитьОбласть("Строка|КолонкаТС" );
	СтрокаПрицепы 			= Макет.ПолучитьОбласть("Строка|КолонкаПрицепы" );
	СтрокаЗадание 			= Макет.ПолучитьОбласть("Строка|КолонкаЗадание" );
	СтрокаСопровождающие 	= Макет.ПолучитьОбласть("Строка|КолонкаСопровождающие" );
	
	Строка1ТС 				= Макет.ПолучитьОбласть("Строка1|КолонкаТС" );
	Строка1Прицепы 			= Макет.ПолучитьОбласть("Строка1|КолонкаПрицепы" );
	Строка1Задание 			= Макет.ПолучитьОбласть("Строка1|КолонкаЗадание" );
	Строка1Сопровождающие 	= Макет.ПолучитьОбласть("Строка1|КолонкаСопровождающие" );
	
	Строка2ТС 				= Макет.ПолучитьОбласть("Строка2|КолонкаТС" );
	Строка2Прицепы 			= Макет.ПолучитьОбласть("Строка2|КолонкаПрицепы" );
	Строка2Задание 			= Макет.ПолучитьОбласть("Строка2|КолонкаЗадание" );
	Строка2Сопровождающие 	= Макет.ПолучитьОбласть("Строка2|КолонкаСопровождающие" );
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	уатРазнарядкаРазнарядка.НомерСтроки,
		|	уатРазнарядкаРазнарядка.Водитель,
		|	уатРазнарядкаРазнарядка.Водитель2,
		|	уатРазнарядкаРазнарядка.ДатаВыезда,
		|	уатРазнарядкаРазнарядка.ДатаВозвращения,
		|	уатРазнарядкаРазнарядка.Контрагент,
		|	уатРазнарядкаРазнарядка.АдресПрибытия,
		|	уатРазнарядкаРазнарядка.ВремяПрибытия,
		|	уатРазнарядкаРазнарядка.Подразделение,
		|	уатРазнарядкаРазнарядка.ТС.уатГаражныйНомер КАК ГаражныйНомер,
		|	уатРазнарядкаРазнарядка.ТС.Код КАК ГосударственныйНомер,
		|	уатРазнарядкаРазнарядка.ТС.уатМодель.Представление КАК Модель,
		|	уатРазнарядкаРазнарядка.Кондуктор,
		|	уатРазнарядкаРазнарядка.Кондуктор2,
		|	уатРазнарядкаРазнарядка.АдресПрибытия2,
		|	уатРазнарядкаРазнарядка.АдресУбытия2,
		|	уатРазнарядкаРазнарядка.ВремяПрибытия2,
		|	уатРазнарядкаРазнарядка.ВремяУбытия2,
		|	уатРазнарядкаРазнарядка.Контрагент2,
		|	уатРазнарядкаРазнарядка.Подразделение2,
		|	уатРазнарядкаРазнарядка.АдресУбытия1,
		|	уатРазнарядкаРазнарядка.ВремяУбытия,
		|	уатРазнарядкаРазнарядка.Прицеп1,
		|	уатРазнарядкаРазнарядка.Прицеп2
		|ИЗ
		|	Документ.уатРазнарядка.Разнарядка КАК уатРазнарядкаРазнарядка
		|ГДЕ
		|	уатРазнарядкаРазнарядка.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент.Ссылка);
		
		ДанныеРазнарядки = Запрос.Выполнить().Выгрузить();
		
		ЕстьСопроповождающие = Ложь;
		ЕстьПрицепы = Ложь;
		Для Каждого ТекСтрока Из ДанныеРазнарядки Цикл
			ЕстьСопроповождающие = ЕстьСопроповождающие ИЛИ (ЗначениеЗаполнено(ТекСтрока.Кондуктор) ИЛИ ЗначениеЗаполнено(ТекСтрока.Кондуктор2));
			ЕстьПрицепы = ЕстьПрицепы ИЛИ (ЗначениеЗаполнено(ТекСтрока.Прицеп1) ИЛИ ЗначениеЗаполнено(ТекСтрока.Прицеп2));
			Если ЕстьСопроповождающие И ЕстьПрицепы Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
		// Заголовок
		ЯчеекОбъединить = 7;
		ЗаголовокТС.Параметры.Заголовок = "Разнарядка на выпуск ТС №" + Строка(ТекущийДокумент.Номер) + " от " + Формат(ТекущийДокумент.Дата, "ДЛФ=Д") + " г.";
		ЗаголовокТС.Параметры.Организация = ТекущийДокумент.Организация;
		ЗаголовокТС.Параметры.Колонна = ТекущийДокумент.Колонна;
		ТабличныйДокумент.Вывести(ЗаголовокТС);
		Если ЕстьПрицепы Тогда
			ЯчеекОбъединить = ЯчеекОбъединить + 1;
			ТабличныйДокумент.Присоединить(ЗаголовокПрицепы);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ЗаголовокЗадание);
		Если ЕстьСопроповождающие Тогда
			ЯчеекОбъединить = ЯчеекОбъединить + 1;
			ТабличныйДокумент.Присоединить(ЗаголовокСопровождающие);
		КонецЕсли; 
		ТабличныйДокумент.Область(3,1,3,ЯчеекОбъединить).Объединить();
		ТабличныйДокумент.Область(4,1,4,ЯчеекОбъединить).Объединить();
		
		// Шапка
		ТабличныйДокумент.Вывести(ШапкаТС);
		Если ЕстьПрицепы Тогда
			ТабличныйДокумент.Присоединить(ШапкаПрицепы);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ШапкаЗадание);
		Если ЕстьСопроповождающие Тогда
			ТабличныйДокумент.Присоединить(ШапкаСопровождающие);
		КонецЕсли;
		
		// Строки табличной части
		Для Каждого ТекСтрока Из ДанныеРазнарядки Цикл
			
			ОтобразитьВтороеЗадание = Ложь;
			
			Если ЗначениеЗаполнено(ТекСтрока.Контрагент2) Или ЗначениеЗаполнено(ТекСтрока.Подразделение2) Или ЗначениеЗаполнено(ТекСтрока.АдресПрибытия2) 
				Или ЗначениеЗаполнено(ТекСтрока.АдресУбытия2) Или ЗначениеЗаполнено(ТекСтрока.ВремяУбытия2) или ЗначениеЗаполнено(ТекСтрока.ВремяПрибытия2) Тогда
				ОтобразитьВтороеЗадание = Истина;
			КонецЕсли;
			
			//Строка 1 - Группа 1
			Область = ?(ОтобразитьВтороеЗадание,Строка1ТС,СтрокаТС);
			Область.Параметры.ГаражныйНомер = ТекСтрока.ГаражныйНомер;
			Область.Параметры.ГосНомер = ТекСтрока.ГосударственныйНомер;
			Область.Параметры.Модель = ТекСтрока.Модель;
			ТабличныйДокумент.Вывести(Область);
			
			//Строка 1 - Группа 2
			Если ЕстьПрицепы Тогда
				Область = ?(ОтобразитьВтороеЗадание,Строка1Прицепы,СтрокаПрицепы);
				Область.Параметры.Прицепы = Строка(ТекСтрока.Прицеп1)
				+ ?(НЕ ЗначениеЗаполнено(ТекСтрока.Прицеп2),"", ", "  + Символы.ПС + ТекСтрока.Прицеп2);
				ТабличныйДокумент.Присоединить(Область);
			КонецЕсли;
			
			//Строка 1 - Группа 3
			Область = ?(ОтобразитьВтороеЗадание,Строка1Задание,СтрокаЗадание);
			Область.Параметры.Водители = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекСтрока.Водитель)
			+ ?(НЕ ЗначениеЗаполнено(ТекСтрока.Водитель2),"", ", " 
			+ Символы.ПС + уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекСтрока.Водитель2));
			Область.Параметры.ДатаВыезда = Формат(ТекСтрока.ДатаВыезда, "ДФ=dd.MM.yy") + " " + Формат(ТекСтрока.ДатаВыезда, "ДФ=ЧЧ:мм");
			Область.Параметры.ДатаВозвращения = Формат(ТекСтрока.ДатаВозвращения, "ДФ=dd.MM.yy") + " " + Формат(ТекСтрока.ДатаВозвращения, "ДФ=ЧЧ:мм");
			Область.Параметры.Контрагент = ТекСтрока.Контрагент;
			Область.Параметры.Подразделение = ТекСтрока.Подразделение;
			Область.Параметры.АдресПрибытия = ТекСтрока.АдресПрибытия;
			Область.Параметры.АдресУбытия = ТекСтрока.АдресУбытия1;
			Область.Параметры.ВремяПрибытия = Формат(ТекСтрока.ВремяПрибытия, "ДФ=ЧЧ:мм");
			Область.Параметры.ВремяУбытия = Формат(ТекСтрока.ВремяУбытия, "ДФ=ЧЧ:мм");
			ТабличныйДокумент.Присоединить(Область);
			
			//Строка 1 - Группа 4
			Если ЕстьСопроповождающие Тогда
				Область = ?(ОтобразитьВтороеЗадание,Строка1Сопровождающие,СтрокаСопровождающие);
				Область.Параметры.СопровождающиеЛица = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекСтрока.Кондуктор) 
				+ ?(НЕ ЗначениеЗаполнено(ТекСтрока.Кондуктор2),"", ", " 
				+ Символы.ПС + уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекСтрока.Кондуктор2));
				ТабличныйДокумент.Присоединить(Область);
			КонецЕсли;
			
			Если ОтобразитьВтороеЗадание Тогда
				
				//Строка 1 - Группа 1
				ТабличныйДокумент.Вывести(Строка2ТС);
				
				//Строка 1 - Группа 2
				Если ЕстьПрицепы Тогда
					ТабличныйДокумент.Присоединить(Строка2Прицепы);
				КонецЕсли;
				
				//Строка 1 - Группа 3
				Строка2Задание.Параметры.Контрагент2 = ТекСтрока.Контрагент2;
				Строка2Задание.Параметры.Подразделение2 = ТекСтрока.Подразделение2;
				Строка2Задание.Параметры.АдресПрибытия2 = ТекСтрока.АдресПрибытия2;
				Строка2Задание.Параметры.АдресУбытия2 = ТекСтрока.АдресУбытия2;
				Строка2Задание.Параметры.ВремяПрибытия2 = Формат(ТекСтрока.ВремяПрибытия2, "ДФ=ЧЧ:мм");
				Строка2Задание.Параметры.ВремяУбытия2 = Формат(ТекСтрока.ВремяУбытия2, "ДФ=ЧЧ:мм");
				ТабличныйДокумент.Присоединить(Строка2Задание);
				
				//Строка 1 - Группа 4
				Если ЕстьСопроповождающие Тогда
					ТабличныйДокумент.Присоединить(Строка2Сопровождающие);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

#КонецОбласти

#КонецЕсли
